// TODO: 2.0 规划


// TODO：参照 bluesky、threads、apple 原生 app 重置，注意设计移动端ui

// TODO：展示 murmurs 的内容下方加上 菜单（修改、threads、等等）按钮，鼠标放到对应murmurs后显示，点击后可以进行操作

// TODO: 增加类似 threads 的逻辑 

// TODO：增加 blog 板块，和murmurs 合到一起

// TODO: 用 Redis 做一个任务队列，将文件上传和处理，打标签任务放到后台执行，执行完毕后给前台通知

// TODO: 目前通知用户等待并在有结果以后刷新的功能做得还不够好，目前调用浏览器刷新的功能，有时候会启用浏览器缓存，要改进



// TODO: 单独的标签页按钮

// TODO：增加运行日志功能

// TODO：在 writeArea  自动粘贴附件，并识别媒体类型

// TODO: 增加标签的增删功能


// TODO: 给所有的 <a></a>  加一个 hover 显示预览效果


// TODO: 自定义一个音频展示的样式，暂时的想法是做成一个圆角矩形的按钮，重点是原型的暂停/考试按钮，圆周用红色展示播放进度


// TODO： write 页，markdown 语法高亮 / 或者直接展示选然后的效果？


// TODO：增加一个草稿箱的功能，自动保存写到一半未发布的内容

// TODO：增加一个 rss 订阅，以及邮箱订阅的 按钮，rss 订阅已经完成


// TODO: 3.0 规划

// TODO：前后端交互 api 化，把所有后端能力通过 api 开放出来


